Autodesk.Revit.UI.DocTranslateUIUtil.RegenAll(Autodesk.Revit.DB.Document,System.String)
RegenAll a family doocumment and saveas in the give folder
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.UI.DocTranslateUIUtil.UpgradeFamilies(System.String)
Upgrade all family documents in the give folder.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.UI.DocTranslateUIUtil
This utility is used to translate content files
Since:
2017